tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "kaplanelad/tap"
tap "nodenv/nodenv"

brew "zsh"
brew "trash"
brew "vim"
brew "watch"
brew "ncdu"
brew "fzf"
brew "eza"
brew "jq"
brew "ripgrep"
brew "bat"
brew "terminal-notifier"
brew "starship"
brew "shellfirm"

brew "coreutils"
brew "git"
brew "tig"
brew "diff-so-fancy"
brew "gnupg"
brew "pinentry-mac"

brew "yarn"
brew "nodenv"
brew "nodenv/nodenv/nodenv-nvmrc"

brew "awscli"
brew "sbt"
brew "pyenv"
brew "jenv"
brew "direnv"
brew "gh"

cask "rectangle"
cask "hammerspoon"
cask "zulu"
cask "zulu8"
cask "slack"
cask "docker"
cask "jetbrains-toolbox"
cask "1password"
cask "iterm2"
cask "alfred"
cask "bartender"
cask "google-chrome"
cask "firefox"
cask "obs"
cask "sogouinput"
cask "vlc"
cask "tableplus"
cask "postman"
cask "spotify"

cask "visual-studio-code"
vscode "streetsidesoftware.code-spell-checker"